Revit 2026 API

# ColumnAttachmentCutStyle Enumeration

---

Control the handling of columns that intersect their targets.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ColumnAttachmentCutStyle
```
```vb
Public Enumeration ColumnAttachmentCutStyle
```
```cpp
public enum class ColumnAttachmentCutStyle
```
```fsharp
type ColumnAttachmentCutStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| CutColumn | 0 |  |
| CutTarget | 1 |  |
| None | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace